Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainBelongsToMultipleBeltIntervals Property
 A chain formed by these curve elements defines a splitter belonging to multiple belt intervals and will be ignored
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCurveChainBelongsToMultipleBeltIntervals { get; }
Public Shared ReadOnly Property DividedSurfaceCurveChainBelongsToMultipleBeltIntervals As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainBelongsToMultipleBeltIntervals {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCurveChainBelongsToMultipleBeltIntervals : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace